# VERİYE İLK BAKIŞ
### Veri Seti Hikayesi ve Yapısının İncelenmesi

* Veri setinin hikayes nedir?
* Veri setleri birden farklı tablolarda veya birden farklı biçimlerde yer alır bunları bir araya getirerek oluştururuz
* Ancak orada da ana yapı itibari ile biraraya getireceğimiz verisetini oluştruan bileşenlerin nasıl oluştuğunu bilmemiz gerekir.
* Verisetlerini genelde kendimiz oluştururuz ancak oluştururkende bileşenlerinin yine oluşma hikasenin nasıl olduğu sorgulanmalıdır. Yani değişkenlerin nasıl oluştuğunu bilirsek bu değişkenlerin üzerine fikirler kararlar bina ediyoruz neticede farklı farklı tablolardan aldığımız verileri
bir araya getirerek oluşturduğumuz verisetinin hikayesini bilmek çok önemli olacaktır.
- 1- Verisetinin nasıl oluştuğunun sorgulanması
- 2- Verisetinin kopyasını al ve manipulasyonu kopyanın üzerinden yap

In [3]:
import seaborn as sns
planets= sns.load_dataset("planets")
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [8]:
df=planets.copy()  # veri setinin kopyası alındı

In [10]:
df.head(5) # veri setinin ilk gözlem biriminden itibaren başındaki 5 gözlem birimi getirildi

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [14]:
df.tail(5) # veri setinin son gözlem biriminden itibaren başa doğru 5 gözlem birimi getirildi

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [20]:
df.info() # veri setinin tüm yapısal bilgileri istendi

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [30]:
df.dtypes #sadece değişkenleri ile ilgili tip bilgileri

method             object
number              int64
orbital_period    float64
mass              float64
distance          float64
year                int64
dtype: object

* Not: object tipindeki değişkenler mutlaka kategorik tipe çevrilmelidir çünkü bazı fonksiyonlar object tipini string olarak kabul ediyor ve istenen çıktıyı vermiyorlar.

In [38]:
import pandas as pd
df.method= pd.Categorical(df.method) # bu şekilde object tipini category olarak değiştirmiş olduk

In [36]:
df.dtypes

method            category
number               int64
orbital_period     float64
mass               float64
distance           float64
year                 int64
dtype: object

In [40]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009